; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob98) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate4)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate2)
	(at pallet5 distributor2)
	(clear crate7)
	(at pallet6 depot1)
	(clear crate11)
	(at pallet7 distributor0)
	(clear pallet7)
	(at pallet8 distributor0)
	(clear pallet8)
	(at pallet9 distributor2)
	(clear crate9)
	(at pallet10 depot1)
	(clear crate3)
	(at truck0 depot0)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 distributor0)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at hoist11 depot0)
	(available hoist11)
	(at hoist12 depot1)
	(available hoist12)
	(at crate0 depot1)
	(on crate0 pallet1)
	(at crate1 depot1)
	(on crate1 pallet6)
	(at crate2 distributor1)
	(on crate2 pallet4)
	(at crate3 depot1)
	(on crate3 pallet10)
	(at crate4 depot1)
	(on crate4 crate0)
	(at crate5 depot1)
	(on crate5 crate1)
	(at crate6 depot1)
	(on crate6 crate5)
	(at crate7 distributor2)
	(on crate7 pallet5)
	(at crate8 distributor2)
	(on crate8 pallet9)
	(at crate9 distributor2)
	(on crate9 crate8)
	(at crate10 depot1)
	(on crate10 crate6)
	(at crate11 depot1)
	(on crate11 crate10)
)

(:goal (and
		(on crate0 pallet5)
		(on crate1 pallet2)
		(on crate2 crate4)
		(on crate3 pallet7)
		(on crate4 pallet8)
		(on crate5 crate8)
		(on crate6 crate3)
		(on crate7 pallet3)
		(on crate8 pallet1)
		(on crate9 pallet9)
		(on crate10 crate1)
		(on crate11 crate5)
	)
))

; plan
1. (lift hoist4 crate2 pallet4 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist4) (on crate2 pallet4)
   added: (lifting hoist4 crate2) (clear pallet4)
   goals met: 0 of 12
2. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 0 of 12
3. (load hoist4 crate2 truck1 distributor1)
   deleted: (lifting hoist4 crate2)
   added: (in crate2 truck1) (available hoist4)
   goals met: 0 of 12
4. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 0 of 12
5. (unload hoist12 crate2 truck1 depot1)
   deleted: (in crate2 truck1) (available hoist12)
   added: (lifting hoist12 crate2)
   goals met: 0 of 12
6. (lift hoist8 crate7 pallet5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist8) (on crate7 pallet5)
   added: (lifting hoist8 crate7) (clear pallet5)
   goals met: 0 of 12
7. (lift hoist5 crate9 crate8 distributor2)
   deleted: (at crate9 distributor2) (clear crate9) (available hoist5) (on crate9 crate8)
   added: (lifting hoist5 crate9) (clear crate8)
   goals met: 0 of 12
8. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 0 of 12
9. (load hoist8 crate7 truck0 distributor2)
   deleted: (lifting hoist8 crate7)
   added: (in crate7 truck0) (available hoist8)
   goals met: 0 of 12
10. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 0 of 12
11. (unload hoist9 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist9)
   added: (lifting hoist9 crate7)
   goals met: 0 of 12
12. (drop hoist9 crate7 pallet3 distributor0)
   deleted: (lifting hoist9 crate7) (clear pallet3)
   added: (available hoist9) (at crate7 distributor0) (clear crate7) (on crate7 pallet3)
   goals met: 1 of 12
13. (lift hoist8 crate8 pallet9 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist8) (on crate8 pallet9)
   added: (lifting hoist8 crate8) (clear pallet9)
   goals met: 1 of 12
14. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 1 of 12
15. (load hoist8 crate8 truck0 distributor2)
   deleted: (lifting hoist8 crate8)
   added: (in crate8 truck0) (available hoist8)
   goals met: 1 of 12
16. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 1 of 12
17. (drop hoist5 crate9 pallet9 distributor2)
   deleted: (lifting hoist5 crate9) (clear pallet9)
   added: (available hoist5) (at crate9 distributor2) (clear crate9) (on crate9 pallet9)
   goals met: 2 of 12
18. (drop hoist12 crate2 crate4 depot1)
   deleted: (lifting hoist12 crate2) (clear crate4)
   added: (available hoist12) (at crate2 depot1) (clear crate2) (on crate2 crate4)
   goals met: 3 of 12
19. (lift hoist12 crate3 pallet10 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist12) (on crate3 pallet10)
   added: (lifting hoist12 crate3) (clear pallet10)
   goals met: 3 of 12
20. (load hoist12 crate3 truck0 depot1)
   deleted: (lifting hoist12 crate3)
   added: (in crate3 truck0) (available hoist12)
   goals met: 3 of 12
21. (lift hoist1 crate11 crate10 depot1)
   deleted: (at crate11 depot1) (clear crate11) (available hoist1) (on crate11 crate10)
   added: (lifting hoist1 crate11) (clear crate10)
   goals met: 3 of 12
22. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 3 of 12
23. (unload hoist9 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist9)
   added: (lifting hoist9 crate3)
   goals met: 3 of 12
24. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 3 of 12
25. (drop hoist9 crate3 pallet7 distributor0)
   deleted: (lifting hoist9 crate3) (clear pallet7)
   added: (available hoist9) (at crate3 distributor0) (clear crate3) (on crate3 pallet7)
   goals met: 4 of 12
26. (lift hoist12 crate10 crate6 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist12) (on crate10 crate6)
   added: (lifting hoist12 crate10) (clear crate6)
   goals met: 4 of 12
27. (load hoist12 crate10 truck0 depot1)
   deleted: (lifting hoist12 crate10)
   added: (in crate10 truck0) (available hoist12)
   goals met: 4 of 12
28. (lift hoist12 crate6 crate5 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist12) (on crate6 crate5)
   added: (lifting hoist12 crate6) (clear crate5)
   goals met: 4 of 12
29. (load hoist1 crate11 truck0 depot1)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck0) (available hoist1)
   goals met: 4 of 12
30. (load hoist12 crate6 truck0 depot1)
   deleted: (lifting hoist12 crate6)
   added: (in crate6 truck0) (available hoist12)
   goals met: 4 of 12
31. (lift hoist12 crate2 crate4 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist12) (on crate2 crate4)
   added: (lifting hoist12 crate2) (clear crate4)
   goals met: 3 of 12
32. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 3 of 12
33. (unload hoist9 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist9)
   added: (lifting hoist9 crate6)
   goals met: 3 of 12
34. (drop hoist9 crate6 crate3 distributor0)
   deleted: (lifting hoist9 crate6) (clear crate3)
   added: (available hoist9) (at crate6 distributor0) (clear crate6) (on crate6 crate3)
   goals met: 4 of 12
35. (drop hoist12 crate2 crate4 depot1)
   deleted: (lifting hoist12 crate2) (clear crate4)
   added: (available hoist12) (at crate2 depot1) (clear crate2) (on crate2 crate4)
   goals met: 5 of 12
36. (lift hoist12 crate5 crate1 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist12) (on crate5 crate1)
   added: (lifting hoist12 crate5) (clear crate1)
   goals met: 5 of 12
37. (unload hoist9 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist9)
   added: (lifting hoist9 crate8)
   goals met: 5 of 12
38. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 5 of 12
39. (load hoist12 crate5 truck0 depot1)
   deleted: (lifting hoist12 crate5)
   added: (in crate5 truck0) (available hoist12)
   goals met: 5 of 12
40. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 5 of 12
41. (unload hoist7 crate11 truck0 distributor0)
   deleted: (in crate11 truck0) (available hoist7)
   added: (lifting hoist7 crate11)
   goals met: 5 of 12
42. (unload hoist6 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist6)
   added: (lifting hoist6 crate5)
   goals met: 5 of 12
43. (lift hoist12 crate2 crate4 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist12) (on crate2 crate4)
   added: (lifting hoist12 crate2) (clear crate4)
   goals met: 4 of 12
44. (drop hoist6 crate5 crate7 distributor0)
   deleted: (lifting hoist6 crate5) (clear crate7)
   added: (available hoist6) (at crate5 distributor0) (clear crate5) (on crate5 crate7)
   goals met: 4 of 12
45. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 4 of 12
46. (drop hoist12 crate2 crate4 depot1)
   deleted: (lifting hoist12 crate2) (clear crate4)
   added: (available hoist12) (at crate2 depot1) (clear crate2) (on crate2 crate4)
   goals met: 5 of 12
47. (unload hoist12 crate10 truck0 depot1)
   deleted: (in crate10 truck0) (available hoist12)
   added: (lifting hoist12 crate10)
   goals met: 5 of 12
48. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 5 of 12
49. (drop hoist12 crate10 crate1 depot1)
   deleted: (lifting hoist12 crate10) (clear crate1)
   added: (available hoist12) (at crate10 depot1) (clear crate10) (on crate10 crate1)
   goals met: 6 of 12
50. (lift hoist12 crate2 crate4 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist12) (on crate2 crate4)
   added: (lifting hoist12 crate2) (clear crate4)
   goals met: 5 of 12
51. (load hoist9 crate8 truck0 distributor0)
   deleted: (lifting hoist9 crate8)
   added: (in crate8 truck0) (available hoist9)
   goals met: 5 of 12
52. (lift hoist9 crate5 crate7 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist9) (on crate5 crate7)
   added: (lifting hoist9 crate5) (clear crate7)
   goals met: 5 of 12
53. (unload hoist6 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist6)
   added: (lifting hoist6 crate8)
   goals met: 5 of 12
54. (drop hoist6 crate8 crate6 distributor0)
   deleted: (lifting hoist6 crate8) (clear crate6)
   added: (available hoist6) (at crate8 distributor0) (clear crate8) (on crate8 crate6)
   goals met: 5 of 12
55. (drop hoist9 crate5 crate8 distributor0)
   deleted: (lifting hoist9 crate5) (clear crate8)
   added: (available hoist9) (at crate5 distributor0) (clear crate5) (on crate5 crate8)
   goals met: 6 of 12
56. (lift hoist1 crate4 crate0 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 crate0)
   added: (lifting hoist1 crate4) (clear crate0)
   goals met: 6 of 12
57. (load hoist12 crate2 truck1 depot1)
   deleted: (lifting hoist12 crate2)
   added: (in crate2 truck1) (available hoist12)
   goals met: 6 of 12
58. (load hoist1 crate4 truck1 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 6 of 12
59. (lift hoist12 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist12) (on crate0 pallet1)
   added: (lifting hoist12 crate0) (clear pallet1)
   goals met: 6 of 12
60. (load hoist12 crate0 truck1 depot1)
   deleted: (lifting hoist12 crate0)
   added: (in crate0 truck1) (available hoist12)
   goals met: 6 of 12
61. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 6 of 12
62. (unload hoist9 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist9)
   added: (lifting hoist9 crate2)
   goals met: 6 of 12
63. (unload hoist6 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist6)
   added: (lifting hoist6 crate4)
   goals met: 6 of 12
64. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 6 of 12
65. (unload hoist8 crate0 truck1 distributor2)
   deleted: (in crate0 truck1) (available hoist8)
   added: (lifting hoist8 crate0)
   goals met: 6 of 12
66. (drop hoist8 crate0 pallet5 distributor2)
   deleted: (lifting hoist8 crate0) (clear pallet5)
   added: (available hoist8) (at crate0 distributor2) (clear crate0) (on crate0 pallet5)
   goals met: 7 of 12
67. (drop hoist6 crate4 pallet8 distributor0)
   deleted: (lifting hoist6 crate4) (clear pallet8)
   added: (available hoist6) (at crate4 distributor0) (clear crate4) (on crate4 pallet8)
   goals met: 8 of 12
68. (drop hoist9 crate2 crate4 distributor0)
   deleted: (lifting hoist9 crate2) (clear crate4)
   added: (available hoist9) (at crate2 distributor0) (clear crate2) (on crate2 crate4)
   goals met: 9 of 12
69. (lift hoist12 crate10 crate1 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist12) (on crate10 crate1)
   added: (lifting hoist12 crate10) (clear crate1)
   goals met: 8 of 12
70. (drop hoist7 crate11 crate5 distributor0)
   deleted: (lifting hoist7 crate11) (clear crate5)
   added: (available hoist7) (at crate11 distributor0) (clear crate11) (on crate11 crate5)
   goals met: 9 of 12
71. (lift hoist1 crate1 pallet6 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet6)
   added: (lifting hoist1 crate1) (clear pallet6)
   goals met: 9 of 12
72. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 9 of 12
73. (load hoist1 crate1 truck1 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   goals met: 9 of 12
74. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 9 of 12
75. (unload hoist2 crate1 truck1 depot2)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   goals met: 9 of 12
76. (drop hoist2 crate1 pallet2 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 pallet2)
   goals met: 10 of 12
77. (drive truck1 depot2 depot1)
   deleted: (at truck1 depot2)
   added: (at truck1 depot1)
   goals met: 10 of 12
78. (load hoist12 crate10 truck1 depot1)
   deleted: (lifting hoist12 crate10)
   added: (in crate10 truck1) (available hoist12)
   goals met: 10 of 12
79. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 10 of 12
80. (unload hoist2 crate10 truck1 depot2)
   deleted: (in crate10 truck1) (available hoist2)
   added: (lifting hoist2 crate10)
   goals met: 10 of 12
81. (drop hoist2 crate10 crate1 depot2)
   deleted: (lifting hoist2 crate10) (clear crate1)
   added: (available hoist2) (at crate10 depot2) (clear crate10) (on crate10 crate1)
   goals met: 11 of 12
82. (lift hoist7 crate11 crate5 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist7) (on crate11 crate5)
   added: (lifting hoist7 crate11) (clear crate5)
   goals met: 10 of 12
83. (lift hoist3 crate5 crate8 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 crate8)
   added: (lifting hoist3 crate5) (clear crate8)
   goals met: 9 of 12
84. (lift hoist9 crate8 crate6 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist9) (on crate8 crate6)
   added: (lifting hoist9 crate8) (clear crate6)
   goals met: 9 of 12
85. (drop hoist3 crate5 crate7 distributor0)
   deleted: (lifting hoist3 crate5) (clear crate7)
   added: (available hoist3) (at crate5 distributor0) (clear crate5) (on crate5 crate7)
   goals met: 9 of 12
86. (load hoist9 crate8 truck0 distributor0)
   deleted: (lifting hoist9 crate8)
   added: (in crate8 truck0) (available hoist9)
   goals met: 9 of 12
87. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 9 of 12
88. (unload hoist12 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist12)
   added: (lifting hoist12 crate8)
   goals met: 9 of 12
89. (drop hoist12 crate8 pallet1 depot1)
   deleted: (lifting hoist12 crate8) (clear pallet1)
   added: (available hoist12) (at crate8 depot1) (clear crate8) (on crate8 pallet1)
   goals met: 10 of 12
90. (lift hoist9 crate5 crate7 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist9) (on crate5 crate7)
   added: (lifting hoist9 crate5) (clear crate7)
   goals met: 10 of 12
91. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 10 of 12
92. (load hoist9 crate5 truck0 distributor0)
   deleted: (lifting hoist9 crate5)
   added: (in crate5 truck0) (available hoist9)
   goals met: 10 of 12
93. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 10 of 12
94. (unload hoist12 crate5 truck0 depot1)
   deleted: (in crate5 truck0) (available hoist12)
   added: (lifting hoist12 crate5)
   goals met: 10 of 12
95. (drop hoist12 crate5 crate8 depot1)
   deleted: (lifting hoist12 crate5) (clear crate8)
   added: (available hoist12) (at crate5 depot1) (clear crate5) (on crate5 crate8)
   goals met: 11 of 12
96. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 11 of 12
97. (load hoist7 crate11 truck0 distributor0)
   deleted: (lifting hoist7 crate11)
   added: (in crate11 truck0) (available hoist7)
   goals met: 11 of 12
98. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 11 of 12
99. (unload hoist12 crate11 truck0 depot1)
   deleted: (in crate11 truck0) (available hoist12)
   added: (lifting hoist12 crate11)
   goals met: 11 of 12
100. (drop hoist12 crate11 crate5 depot1)
   deleted: (lifting hoist12 crate11) (clear crate5)
   added: (available hoist12) (at crate11 depot1) (clear crate11) (on crate11 crate5)
   goals met: 12 of 12
